In [1]:
 # data analysis and wrangling
import pandas as pd
import numpy as np
import random as rnd

 # visualization
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

train_df = pd.read_csv('data/train_longevity.csv')
test_df = pd.read_csv('data/test_longevity.csv')
combine = [train_df, test_df]

train_df.shape      # мы увидим информацию о размерности нашего датафрейма 
train_df.info()     # покажет информацию о размерности данных 
                          # описание индекса, количество not-a-number элементов 
train_df.head()         # показывает первые 10 значений датасета
train_df.describe()     # показывает статистики count,mean, std, min, 25%-50%-75% percentile, max 
train_df.nunique()     # количество уникальных значений для каждого столбца

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 857 entries, 0 to 856
Data columns (total 11 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Id         857 non-null    int64
 1   Longevity  857 non-null    int64
 2   Education  857 non-null    int64
 3   Sex        857 non-null    object
 4   Age        680 non-null    object
 5   Pet        857 non-null    int64
 6   Children   857 non-null    int64
 7   Region     857 non-null    object
 8   Activity   857 non-null    int64
 9   MedExam    196 non-null    object
 10  Sport      236 non-null    object
dtypes: int64(6), object(5)
memory usage: 73.8+ KB

Id           857
Longevity      2
Education      3
Sex            2
Age           12
Pet            7
Children       7
Region        51
Activity     229
MedExam        5
Sport          2
dtype: int64

In [2]:
### 1
train_df['Age'].unique()
test_df['Age'].unique()

def is_number(a):
    try:
        a = float(a)
    except:
        return False
    
    return not np.isnan(a)

idmax = train_df['Age'].value_counts().idxmax()
train_df['Age'] = train_df['Age'].map(lambda v: v if is_number(v) else idmax).astype(float)
test_df['Age'] = test_df['Age'].map(lambda v: v if is_number(v) else idmax).astype(float)

In [3]:
### 2
train_df = train_df.drop(columns="MedExam")
test_df = test_df.drop(columns="MedExam")
train_df.head()

,Id,Longevity,Education,Sex,Age,Pet,Children,Region,Activity,Sport
0,1,0,3,female,73.0,1,0,21,725,NaN
1,2,1,1,male,75.0,1,0,17,7128,+
2,3,1,3,male,73.0,0,0,31,793,NaN
3,4,1,1,male,74.0,1,0,11,5310,NaN
4,5,0,3,female,74.0,0,0,37,805,NaN

In [4]:
### 4
train_df = train_df.drop(columns="Region")
train_df.head()

   Id  Longevity  Education     Sex   Age  Pet  Children  Activity Sport
0   1          0          3  female  73.0    1         0       725   NaN
1   2          1          1    male  75.0    1         0      7128     +
2   3          1          3    male  73.0    0         0       793   NaN
3   4          1          1    male  74.0    1         0      5310   NaN
4   5          0          3  female  74.0    0         0       805   NaN

In [5]:
### 5
train_df = train_df.drop(columns="Id")
train_df.head()

   Longevity  Education     Sex   Age  Pet  Children  Activity Sport
0          0          3  female  73.0    1         0       725   NaN
1          1          1    male  75.0    1         0      7128     +
2          1          3    male  73.0    0         0       793   NaN
3          1          1    male  74.0    1         0      5310   NaN
4          0          3  female  74.0    0         0       805   NaN

In [6]:
### 6
train_df["Family"] = train_df["Pet"] + train_df["Children"]

In [7]:
### 7
train_df["IsAlone"] = train_df.apply(lambda row: 1 if not row.Family else 0, axis=1)

In [8]:
### 8
def groupAge(age):
    interval =  np.arange(70, 80+2, 2)
    l = len(interval)
    i = 0
    while i < l and age > interval[i]:
        i += 1
    return i

train_df["Age"] = train_df["Age"].map(lambda a: groupAge(a))

In [9]:
### 7.2
train_df["Age*Education"] = train_df["Age"] * train_df["Education"]
train_df.head()

,Longevity,Education,Sex,Age,Pet,Children,Activity,Sport,Family,IsAlone,Age*Education
0,0,3,female,2,1,0,725,NaN,1,0,6
1,1,1,male,3,1,0,7128,+,1,0,3
2,1,3,male,2,0,0,793,NaN,0,1,6
3,1,1,male,2,1,0,5310,NaN,1,0,2
4,0,3,female,2,0,0,805,NaN,0,1,6